CSI API ETABS v1
cAnalyze.GetSolverOption_1 Method
 DEPRECATED. Please see GetSolverOption_2(Int32, Int32, Int32, String) or GetSolverOption_3(Int32, Int32, Int32, Int32, Int32, String)
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSolverOption_1(
	ref int SolverType,
	ref int SolverProcessType,
	ref bool Force32BitSolver,
	ref string StiffCase
)
Function GetSolverOption_1 (
	ByRef SolverType As Integer,
	ByRef SolverProcessType As Integer,
	ByRef Force32BitSolver As Boolean,
	ByRef StiffCase As String
) As Integer
Dim instance As cAnalyze
Dim SolverType As Integer
Dim SolverProcessType As Integer
Dim Force32BitSolver As Boolean
Dim StiffCase As String
Dim returnValue As Integer
returnValue = instance.GetSolverOption_1(SolverType,
	SolverProcessType, Force32BitSolver,
	StiffCase)
int GetSolverOption_1(
	int% SolverType,
	int% SolverProcessType,
	bool% Force32BitSolver,
	String^% StiffCase
)
abstract GetSolverOption_1 :
        SolverType : int byref *
        SolverProcessType : int byref *
        Force32BitSolver : bool byref *
        StiffCase : string byref -> int
Parameters
SolverType
Type: System.Int32
SolverProcessType
Type: System.Int32
Force32BitSolver
Type: System.Boolean
StiffCase
Type: System.String
Return Value
Type: Int32
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace